---
kind: property
id: P:Autodesk.Revit.DB.LinePatternSegment.Type
zh: 类型
source: html/0045c894-895c-978a-40bd-06bae49abc34.htm
---
# Autodesk.Revit.DB.LinePatternSegment.Type Property

**中文**: 类型

Gets and sets the type of the segment.

## Syntax (C#)
```csharp
public LinePatternSegmentType Type { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration